driver-tests/httpsoapbc/CustomerScenarios/GM/ProcessLoanApp/test/Credit_Score_of_600/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:req="http://www.gm.com/csto/v1/process/loan/request">
  <soapenv:Body>
    <req:ProcessLoanRequest>
      <req:DocumentID>DocID002</req:DocumentID>
      <req:CustomerData>
        <req:CustomerID>6264716280</req:CustomerID>
        <req:RequestID>ReqID002</req:RequestID>
        <req:CreditScore>600</req:CreditScore>
      </req:CustomerData>
      <req:Financing>
        <req:FinanceType>FinTypeAuto</req:FinanceType>
        <req:MonthlyPaymentAmount>678</req:MonthlyPaymentAmount>
        <req:Term>72</req:Term>
        <!--Optional:-->
        <req:DownPaymentAmount>5000</req:DownPaymentAmount>
        <req:VehiclePurchasePrice>43750</req:VehiclePurchasePrice>
        <!--Optional:-->
        <req:MiscellaneousNotes>?string?</req:MiscellaneousNotes>
        <!--Optional:-->
        <req:AnnualPercentageRate>7.3</req:AnnualPercentageRate>
        <!--Optional:-->
        <req:SalesOrderNumber>SaleOrderNum002</req:SalesOrderNumber>
      </req:Financing>
    </req:ProcessLoanRequest>
  </soapenv:Body>
</soapenv:Envelope>