driver-tests/httpsoapbc/CustomerScenarios/GM/ProcessLoanApp/test/Credit_Score_of_601/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:req="http://www.gm.com/csto/v1/process/loan/request">
  <soapenv:Body>
    <req:ProcessLoanRequest>
      <req:DocumentID>DocID001</req:DocumentID>
      <req:CustomerData>
        <req:CustomerID>6264716380</req:CustomerID>
        <req:RequestID>ReqID001</req:RequestID>
        <req:CreditScore>601</req:CreditScore>
      </req:CustomerData>
      <req:Financing>
        <req:FinanceType>FinTypeAuto</req:FinanceType>
        <req:MonthlyPaymentAmount>528</req:MonthlyPaymentAmount>
        <req:Term>60</req:Term>
        <!--Optional:-->
        <req:DownPaymentAmount>12000</req:DownPaymentAmount>
        <req:VehiclePurchasePrice>33500</req:VehiclePurchasePrice>
        <!--Optional:-->
        <req:MiscellaneousNotes>?string?</req:MiscellaneousNotes>
        <!--Optional:-->
        <req:AnnualPercentageRate>8.2</req:AnnualPercentageRate>
        <!--Optional:-->
        <req:SalesOrderNumber>SaleOrderNum001</req:SalesOrderNumber>
      </req:Financing>
    </req:ProcessLoanRequest>
  </soapenv:Body>
</soapenv:Envelope>